andrewleech/micropython/ports/stm32/usbd_conf.c
        // Enable VDDUSB
        #if defined(STM32H5) || defined(STM32WB)
        HAL_PWREx_EnableVddUSB();
        #elif defined(STM32L4) || defined(STM32U5)
        if (__HAL_RCC_PWR_IS_CLK_DISABLED()) {
            __HAL_RCC_PWR_CLK_ENABLE();
            HAL_PWREx_EnableVddUSB();
            __HAL_RCC_PWR_CLK_DISABLE();
        } else {
            HAL_PWREx_EnableVddUSB();
        }
        #endif

        // Configure and enable USB FS interrupt
        #if defined(STM32G0)
        NVIC_SetPriority(USB_UCPD1_2_IRQn, IRQ_PRI_OTG_FS);
        HAL_NVIC_EnableIRQ(USB_UCPD1_2_IRQn);
        #elif defined(STM32H5)
        NVIC_SetPriority(USB_DRD_FS_IRQn, IRQ_PRI_OTG_FS);
        HAL_NVIC_EnableIRQ(USB_DRD_FS_IRQn);
        #elif defined(STM32L0)
        NVIC_SetPriority(USB_IRQn, IRQ_PRI_OTG_FS);
        HAL_NVIC_EnableIRQ(USB_IRQn);
        #elif defined(STM32L432xx) || defined(STM32L452xx)
        NVIC_SetPriority(USB_FS_IRQn, IRQ_PRI_OTG_FS);
        HAL_NVIC_EnableIRQ(USB_FS_IRQn);
        #elif defined(STM32G4) || defined(STM32L1) || defined(STM32WB)
        NVIC_SetPriority(USB_LP_IRQn, IRQ_PRI_OTG_FS);
        HAL_NVIC_EnableIRQ(USB_LP_IRQn);
        #else
        NVIC_SetPriority(OTG_FS_IRQn, IRQ_PRI_OTG_FS);
        HAL_NVIC_EnableIRQ(OTG_FS_IRQn);
        #endif

        #if MICROPY_HW_TINYUSB_STACK && (defined(STM32F4) || defined(STM32F7))
        mp_usbd_configure_vbus_sensing(USB_OTG_FS);
        #endif
    }
}

#if MICROPY_HW_USB_HOST
// Configure host-mode-specific hardware (VBUS power switch)
// This should be called when switching from device to host mode
void mp_usbh_ll_init_vbus_fs(void) {
    #ifdef MICROPY_HW_USB_VBUS_POWER_PIN
    // Enable VBUS power output (PG6 on NUCLEO-F429ZI)
    // Configure as push-pull output to match TinyUSB BSP
    const machine_pin_obj_t *vbus_pin = MICROPY_HW_USB_VBUS_POWER_PIN;
    GPIO_InitTypeDef gpio_vbus = {
        .Pin = 1 << vbus_pin->pin,
            .Mode = GPIO_MODE_OUTPUT_PP,
            .Pull = GPIO_PULLDOWN,
            .Speed = GPIO_SPEED_HIGH,
    };
    HAL_GPIO_Init(vbus_pin->gpio, &gpio_vbus);
    HAL_GPIO_WritePin(vbus_pin->gpio, gpio_vbus.Pin, GPIO_PIN_SET);
    #endif
}
#endif

#endif // MICROPY_HW_USB_FS

#if MICROPY_HW_USB_HS
static void mp_usbd_ll_init_hs(void) {
    {
        #if MICROPY_HW_USB_HS_IN_FS

        // Configure USB GPIO's.

        #if defined(STM32H723xx) || (STM32H7A3xx) || defined(STM32H7A3xxQ) || defined(STM32U5)

        // These MCUs don't have an alternate function for USB but rather require
        // the pins to be disconnected from all peripherals, ie put in analog mode.

        #if defined(MICROPY_HW_USB_OTG_ID_PIN)
        const uint32_t otg_alt = GPIO_AF10_OTG1_FS;
        #endif

        mp_hal_pin_config(pin_A11, MP_HAL_PIN_MODE_ANALOG, MP_HAL_PIN_PULL_NONE, 0);
        mp_hal_pin_config_speed(pin_A11, GPIO_SPEED_FREQ_VERY_HIGH);
        mp_hal_pin_config(pin_A12, MP_HAL_PIN_MODE_ANALOG, MP_HAL_PIN_PULL_NONE, 0);
        mp_hal_pin_config_speed(pin_A12, GPIO_SPEED_FREQ_VERY_HIGH);

        #if defined(STM32U5)
        HAL_SYSCFG_SetOTGPHYReferenceClockSelection(SYSCFG_OTG_HS_PHY_CLK_SELECT_1);

        // Peripheral clock enable
        __HAL_RCC_USB_OTG_HS_CLK_ENABLE();
        __HAL_RCC_USBPHYC_CLK_ENABLE();

        // Enable VDDUSB
        if (__HAL_RCC_PWR_IS_CLK_DISABLED()) {
            __HAL_RCC_PWR_CLK_ENABLE();
            HAL_PWREx_EnableVddUSB();

            // configure VOSR register of USB
            HAL_PWREx_EnableUSBHSTranceiverSupply();
            __HAL_RCC_PWR_CLK_DISABLE();
        } else {
            HAL_PWREx_EnableVddUSB();

            // configure VOSR register of USB
            HAL_PWREx_EnableUSBHSTranceiverSupply();
        }

        // Configuring the SYSCFG registers OTG_HS PHY
        // OTG_HS PHY enable
        HAL_SYSCFG_EnableOTGPHY(SYSCFG_OTG_HS_PHY_ENABLE);
        #endif

        #elif defined(STM32N6)

        // These MCUs have dedicated USB pins.

        #else

        // Other MCUs have an alternate function for GPIO's to be in USB mode.

        #if defined(STM32H7B3xx) || defined(STM32H7B3xxQ)
        const uint32_t otg_alt = GPIO_AF10_OTG1_FS;
        #elif defined(STM32H7)
        const uint32_t otg_alt = GPIO_AF12_OTG2_FS;
        #else
        const uint32_t otg_alt = GPIO_AF12_OTG_HS_FS;
        #endif

        mp_hal_pin_config(pin_B14, MP_HAL_PIN_MODE_ALT, MP_HAL_PIN_PULL_NONE, otg_alt);
        mp_hal_pin_config_speed(pin_B14, GPIO_SPEED_FREQ_VERY_HIGH);
        mp_hal_pin_config(pin_B15, MP_HAL_PIN_MODE_ALT, MP_HAL_PIN_PULL_NONE, otg_alt);
        mp_hal_pin_config_speed(pin_B15, GPIO_SPEED_FREQ_VERY_HIGH);

        #endif

        #if defined(MICROPY_HW_USB_VBUS_DETECT_PIN)
        // Configure VBUS Pin
        mp_hal_pin_config(MICROPY_HW_USB_VBUS_DETECT_PIN, MP_HAL_PIN_MODE_INPUT, MP_HAL_PIN_PULL_NONE, 0);
        #endif

        #if defined(MICROPY_HW_USB_OTG_ID_PIN)
        // Configure ID pin
        #if MICROPY_HW_USB_HOST
        // For host mode: configure as alternate function with pull-down (A-device, ID=low)
        mp_hal_pin_config(MICROPY_HW_USB_OTG_ID_PIN, MP_HAL_PIN_MODE_ALT_OPEN_DRAIN, MP_HAL_PIN_PULL_DOWN, otg_alt);
        #else
        // For device mode: configure as alternate function with pull-up (B-device, ID=high)
        mp_hal_pin_config(MICROPY_HW_USB_OTG_ID_PIN, MP_HAL_PIN_MODE_ALT_OPEN_DRAIN, MP_HAL_PIN_PULL_UP, otg_alt);
        #endif
        #endif

        #if defined(STM32N6)

        __HAL_RCC_USB1_OTG_HS_FORCE_RESET();
        __HAL_RCC_USB1_OTG_HS_PHY_FORCE_RESET();
        __HAL_RCC_USB1_OTG_HS_PHY_RELEASE_RESET();
        __HAL_RCC_USB1_OTG_HS_RELEASE_RESET();

        LL_AHB5_GRP1_EnableClock(LL_AHB5_GRP1_PERIPH_OTG1);
        LL_AHB5_GRP1_EnableClock(LL_AHB5_GRP1_PERIPH_OTGPHY1);
        LL_AHB5_GRP1_EnableClockLowPower(LL_AHB5_GRP1_PERIPH_OTG1);
        LL_AHB5_GRP1_EnableClockLowPower(LL_AHB5_GRP1_PERIPH_OTGPHY1);

        // Select 24MHz clock.
        MODIFY_REG(USB1_HS_PHYC->USBPHYC_CR, USB_USBPHYC_CR_FSEL, 2 << USB_USBPHYC_CR_FSEL_Pos);

        #else

        // Enable calling WFI and correct function of the embedded USB_FS_IN_HS phy
        #if !defined(STM32U5)
        __HAL_RCC_USB_OTG_HS_ULPI_CLK_SLEEP_DISABLE();
        #endif
        __HAL_RCC_USB_OTG_HS_CLK_SLEEP_ENABLE();

        // Enable USB HS Clocks

        #if defined(STM32F723xx) || defined(STM32F733xx)
        // Needs to remain awake during sleep or else __WFI() will disable the USB
        __HAL_RCC_USB_OTG_HS_ULPI_CLK_SLEEP_ENABLE();
        __HAL_RCC_OTGPHYC_CLK_ENABLE();
        __HAL_RCC_USB_OTG_HS_ULPI_CLK_ENABLE();
        #endif

        __HAL_RCC_USB_OTG_HS_CLK_ENABLE();

        #endif

